app/Http/Controllers/ArticleController.php

select * from `articles`
---
    public function index()
    {
        $article=Article::all()->sortByDesc("id");

select * from `category`
---
    public function create(){
        $category =Category::all();