app/Http/Controllers/CategoryController.php

    public function index()
    {
        $category=Category::all()->sortByDesc("id");
---
select * from `category`