app/Http/Controllers/GalleryController.php

select * from `gallery`
---
    public function index()
    {


        $gallery=Gallery::all()->sortByDesc("id");