app/Http/Controllers/GunasoController.php

    public function index(){


        $gunaso = Gunaso::all();
---
select * from `gunaso`

    public function gunaso(){




        $menu = Menu::orderBy('order', 'ASC')->get();
---
select * from `menus` order by `order` asc

    public function store(Request $request){
        $input = Input::only('full_name','email','phone','type','subject','message');
        $this->validate($request, [
            'full_name' => 'required|max:255|',
            'email' => 'required',
            'phone' => 'required',
            'type' => 'required',
            'subject' => 'required',
            'message' => 'required',
        ]);

        $gunaso = new Gunaso();
        $gunaso->full_name=$input['full_name'];
        $gunaso->email=$input['email'];
        $gunaso->phone=$input['phone'];
        $gunaso->type=$input['type'];
        $gunaso->subject=$input['subject'];
        $gunaso->message=$input['message'];
        $gunaso->save();
---
insert into `gunaso` (`full_name`, `email`, `phone`, `type`, `subject`, `message`, `updated_at`, `created_at`) values ('afa', 'afafa@gmail.com', 'afa', 'suggestions', 'afaf', 'afa', '2017-07-04 09:17:54', '2017-07-04 09:17:54')