app/Http/Controllers/HomeController.php

select * from `category`
select * from `articles`
select * from `slider`
select * from `gallery`
---
    public function index()
    {
        // view('home');

        $category = Category::all();
        $articles = Article::all();
        $slider = Slider::all();
        $gallery = Gallery::all();