app/Http/Controllers/MemberController.php

    public function index()
    {
        $member=Member::all()->sortByDesc("id");
---
select * from `members`