app/Http/Controllers/MenuController.php

    public function index()
    {
        $menu=Menu::all()->sortByDesc("id");
---
select * from `menus`