app/Http/Controllers/ReportController.php

select * from `reports`
---
    public function index()
    {
        $report=Report::all()->sortByDesc("id");;