app/Http/Controllers/SliderController.php

select * from `slider`
---
    public function index()
    {
        $report=Slider::all()->sortByDesc("id");