app/Http/Controllers/SupportController.php

select * from `supports`
---
    public function index(){
        $support = Support::all();

select * from `menus`
---
    public function create(){

        $menu = Menu::all();