app/Http/Controllers/SupportController.php

select * from `menus`
---
    public function create(){

        $menu = Menu::all();