app/Http/Controllers/UserController.php

select * from `slider`
select * from `members` where `head` = '1' limit 1
select * from `reports` where `type` = '1'
select * from `reports` where `type` = '2'
select * from `articles` where `category_id` = '1'
select * from `articles` where `home_page` = '1' limit 1
select * from `menus` order by `order` asc
select * from `articles` where `breaking_news` = '1' order by `created_at` desc
---
    public function index()
    {


        $slider = Slider::all();
        $member = Member::where('head', '1')->first();


        $annual_report = Report::where('type', '0')->get();
        $publications = Report::where('type', '1')->get();
        $notice = Report::where('type', '2')->get();
        $news = Article::where('category_id', '1')
            ->get();

        $homeArticle=Article::where('home_page','1')->first();

        $menu = Menu::orderBy('order', 'ASC')->get();

        $breaking_news = Article::where('breaking_news', '1')
            ->orderBy('created_at','DESC')
            ->get();

select * from `menus` order by `order` asc
---
    public function photos()
    {
        $menu = Menu::orderBy('order', 'ASC')->get();

select * from `articles` where `articles`.`id` = '1' limit 1
select * from `menus` order by `order` asc
---
    public function post($id)
    {
        $article = Article::findOrfail($id);
        $menu = Menu::orderBy('order', 'ASC')->get();

select * from `menus` order by `order` asc
---
    public function slug($slug)
    {
        $article = Article::where('slug',$slug)->first();

        if(empty($article)){
            abort(404);
        }

        $menu = Menu::orderBy('order', 'ASC')->get();